{
    "name": "model_56",
    "layers": [
        {
            "class_name": "InputLayer",
            "config": {
                "batch_input_shape": [
                    null,
                    1024,
                    1
                ],
                "dtype": "float32",
                "sparse": false,
                "ragged": false,
                "name": "conv1d_16_input"
            },
            "name": "conv1d_16_input",
            "inbound_nodes": []
        },
        {
            "class_name": "Conv1D",
            "config": {
                "name": "conv1d_16",
                "trainable": true,
                "batch_input_shape": [
                    null,
                    1024,
                    1
                ],
                "dtype": "float32",
                "filters": 9,
                "kernel_size": [
                    5
                ],
                "strides": [
                    1
                ],
                "padding": "valid",
                "data_format": "channels_last",
                "dilation_rate": [
                    1
                ],
                "groups": 1,
                "activation": "linear",
                "use_bias": true,
                "kernel_initializer": {
                    "class_name": "GlorotUniform",
                    "config": {
                        "seed": null
                    }
                },
                "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
            },
            "name": "conv1d_16",
            "inbound_nodes": [
                [
                    [
                        "conv1d_16_input",
                        0,
                        0,
                        {}
                    ]
                ]
            ]
        },
        {
            "class_name": "LeakyReLU",
            "config": {
                "name": "leaky_re_lu_18",
                "trainable": true,
                "dtype": "float32",
                "alpha": 0.10000000149011612
            },
            "name": "leaky_re_lu_18",
            "inbound_nodes": [
                [
                    [
                        "conv1d_16",
                        0,
                        0,
                        {}
                    ]
                ]
            ]
        },
        {
            "class_name": "Conv1D",
            "config": {
                "name": "conv1d_17",
                "trainable": true,
                "dtype": "float32",
                "filters": 9,
                "kernel_size": [
                    5
                ],
                "strides": [
                    1
                ],
                "padding": "valid",
                "data_format": "channels_last",
                "dilation_rate": [
                    1
                ],
                "groups": 1,
                "activation": "linear",
                "use_bias": true,
                "kernel_initializer": {
                    "class_name": "GlorotUniform",
                    "config": {
                        "seed": null
                    }
                },
                "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
            },
            "name": "conv1d_17",
            "inbound_nodes": [
                [
                    [
                        "leaky_re_lu_18",
                        0,
                        0,
                        {}
                    ]
                ]
            ]
        },
        {
            "class_name": "LeakyReLU",
            "config": {
                "name": "leaky_re_lu_19",
                "trainable": true,
                "dtype": "float32",
                "alpha": 0.10000000149011612
            },
            "name": "leaky_re_lu_19",
            "inbound_nodes": [
                [
                    [
                        "conv1d_17",
                        0,
                        0,
                        {}
                    ]
                ]
            ]
        },
        {
            "class_name": "MaxPooling1D",
            "config": {
                "name": "max_pooling1d_8",
                "trainable": true,
                "dtype": "float32",
                "strides": [
                    2
                ],
                "pool_size": [
                    2
                ],
                "padding": "valid",
                "data_format": "channels_last"
            },
            "name": "max_pooling1d_8",
            "inbound_nodes": [
                [
                    [
                        "leaky_re_lu_19",
                        0,
                        0,
                        {}
                    ]
                ]
            ]
        },
        {
            "class_name": "Conv1D",
            "config": {
                "name": "conv1d_18",
                "trainable": true,
                "dtype": "float32",
                "filters": 13,
                "kernel_size": [
                    15
                ],
                "strides": [
                    1
                ],
                "padding": "valid",
                "data_format": "channels_last",
                "dilation_rate": [
                    1
                ],
                "groups": 1,
                "activation": "linear",
                "use_bias": true,
                "kernel_initializer": {
                    "class_name": "GlorotUniform",
                    "config": {
                        "seed": null
                    }
                },
                "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
            },
            "name": "conv1d_18",
            "inbound_nodes": [
                [
                    [
                        "max_pooling1d_8",
                        0,
                        0,
                        {}
                    ]
                ]
            ]
        },
        {
            "class_name": "LeakyReLU",
            "config": {
                "name": "leaky_re_lu_20",
                "trainable": true,
                "dtype": "float32",
                "alpha": 0.10000000149011612
            },
            "name": "leaky_re_lu_20",
            "inbound_nodes": [
                [
                    [
                        "conv1d_18",
                        0,
                        0,
                        {}
                    ]
                ]
            ]
        },
        {
            "class_name": "Conv1D",
            "config": {
                "name": "conv1d_19",
                "trainable": true,
                "dtype": "float32",
                "filters": 13,
                "kernel_size": [
                    15
                ],
                "strides": [
                    1
                ],
                "padding": "valid",
                "data_format": "channels_last",
                "dilation_rate": [
                    1
                ],
                "groups": 1,
                "activation": "linear",
                "use_bias": true,
                "kernel_initializer": {
                    "class_name": "GlorotUniform",
                    "config": {
                        "seed": null
                    }
                },
                "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
            },
            "name": "conv1d_19",
            "inbound_nodes": [
                [
                    [
                        "leaky_re_lu_20",
                        0,
                        0,
                        {}
                    ]
                ]
            ]
        },
        {
            "class_name": "LeakyReLU",
            "config": {
                "name": "leaky_re_lu_21",
                "trainable": true,
                "dtype": "float32",
                "alpha": 0.10000000149011612
            },
            "name": "leaky_re_lu_21",
            "inbound_nodes": [
                [
                    [
                        "conv1d_19",
                        0,
                        0,
                        {}
                    ]
                ]
            ]
        },
        {
            "class_name": "MaxPooling1D",
            "config": {
                "name": "max_pooling1d_9",
                "trainable": true,
                "dtype": "float32",
                "strides": [
                    2
                ],
                "pool_size": [
                    2
                ],
                "padding": "valid",
                "data_format": "channels_last"
            },
            "name": "max_pooling1d_9",
            "inbound_nodes": [
                [
                    [
                        "leaky_re_lu_21",
                        0,
                        0,
                        {}
                    ]
                ]
            ]
        },
        {
            "class_name": "Conv1D",
            "config": {
                "name": "conv1d_20",
                "trainable": true,
                "dtype": "float32",
                "filters": 21,
                "kernel_size": [
                    25
                ],
                "strides": [
                    1
                ],
                "padding": "valid",
                "data_format": "channels_last",
                "dilation_rate": [
                    1
                ],
                "groups": 1,
                "activation": "linear",
                "use_bias": true,
                "kernel_initializer": {
                    "class_name": "GlorotUniform",
                    "config": {
                        "seed": null
                    }
                },
                "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
            },
            "name": "conv1d_20",
            "inbound_nodes": [
                [
                    [
                        "max_pooling1d_9",
                        0,
                        0,
                        {}
                    ]
                ]
            ]
        },
        {
            "class_name": "LeakyReLU",
            "config": {
                "name": "leaky_re_lu_22",
                "trainable": true,
                "dtype": "float32",
                "alpha": 0.10000000149011612
            },
            "name": "leaky_re_lu_22",
            "inbound_nodes": [
                [
                    [
                        "conv1d_20",
                        0,
                        0,
                        {}
                    ]
                ]
            ]
        },
        {
            "class_name": "Dropout",
            "config": {
                "name": "dropout_10",
                "trainable": true,
                "dtype": "float32",
                "rate": 0.5,
                "noise_shape": null,
                "seed": null
            },
            "name": "dropout_10",
            "inbound_nodes": [
                [
                    [
                        "leaky_re_lu_22",
                        0,
                        0,
                        {}
                    ]
                ]
            ]
        },
        {
            "class_name": "Conv1D",
            "config": {
                "name": "conv1d_21",
                "trainable": true,
                "dtype": "float32",
                "filters": 21,
                "kernel_size": [
                    25
                ],
                "strides": [
                    1
                ],
                "padding": "valid",
                "data_format": "channels_last",
                "dilation_rate": [
                    1
                ],
                "groups": 1,
                "activation": "linear",
                "use_bias": true,
                "kernel_initializer": {
                    "class_name": "GlorotUniform",
                    "config": {
                        "seed": null
                    }
                },
                "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
            },
            "name": "conv1d_21",
            "inbound_nodes": [
                [
                    [
                        "dropout_10",
                        0,
                        0,
                        {}
                    ]
                ]
            ]
        },
        {
            "class_name": "LeakyReLU",
            "config": {
                "name": "leaky_re_lu_23",
                "trainable": true,
                "dtype": "float32",
                "alpha": 0.10000000149011612
            },
            "name": "leaky_re_lu_23",
            "inbound_nodes": [
                [
                    [
                        "conv1d_21",
                        0,
                        0,
                        {}
                    ]
                ]
            ]
        },
        {
            "class_name": "Dropout",
            "config": {
                "name": "dropout_11",
                "trainable": true,
                "dtype": "float32",
                "rate": 0.5,
                "noise_shape": null,
                "seed": null
            },
            "name": "dropout_11",
            "inbound_nodes": [
                [
                    [
                        "leaky_re_lu_23",
                        0,
                        0,
                        {}
                    ]
                ]
            ]
        },
        {
            "class_name": "MaxPooling1D",
            "config": {
                "name": "max_pooling1d_10",
                "trainable": true,
                "dtype": "float32",
                "strides": [
                    2
                ],
                "pool_size": [
                    2
                ],
                "padding": "valid",
                "data_format": "channels_last"
            },
            "name": "max_pooling1d_10",
            "inbound_nodes": [
                [
                    [
                        "dropout_11",
                        0,
                        0,
                        {}
                    ]
                ]
            ]
        },
        {
            "class_name": "Conv1D",
            "config": {
                "name": "conv1d_22",
                "trainable": true,
                "dtype": "float32",
                "filters": 21,
                "kernel_size": [
                    35
                ],
                "strides": [
                    1
                ],
                "padding": "valid",
                "data_format": "channels_last",
                "dilation_rate": [
                    1
                ],
                "groups": 1,
                "activation": "linear",
                "use_bias": true,
                "kernel_initializer": {
                    "class_name": "GlorotUniform",
                    "config": {
                        "seed": null
                    }
                },
                "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
            },
            "name": "conv1d_22",
            "inbound_nodes": [
                [
                    [
                        "max_pooling1d_10",
                        0,
                        0,
                        {}
                    ]
                ]
            ]
        },
        {
            "class_name": "LeakyReLU",
            "config": {
                "name": "leaky_re_lu_24",
                "trainable": true,
                "dtype": "float32",
                "alpha": 0.10000000149011612
            },
            "name": "leaky_re_lu_24",
            "inbound_nodes": [
                [
                    [
                        "conv1d_22",
                        0,
                        0,
                        {}
                    ]
                ]
            ]
        },
        {
            "class_name": "Dropout",
            "config": {
                "name": "dropout_12",
                "trainable": true,
                "dtype": "float32",
                "rate": 0.5,
                "noise_shape": null,
                "seed": null
            },
            "name": "dropout_12",
            "inbound_nodes": [
                [
                    [
                        "leaky_re_lu_24",
                        0,
                        0,
                        {}
                    ]
                ]
            ]
        },
        {
            "class_name": "Conv1D",
            "config": {
                "name": "conv1d_23",
                "trainable": true,
                "dtype": "float32",
                "filters": 21,
                "kernel_size": [
                    35
                ],
                "strides": [
                    1
                ],
                "padding": "valid",
                "data_format": "channels_last",
                "dilation_rate": [
                    1
                ],
                "groups": 1,
                "activation": "linear",
                "use_bias": true,
                "kernel_initializer": {
                    "class_name": "GlorotUniform",
                    "config": {
                        "seed": null
                    }
                },
                "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
            },
            "name": "conv1d_23",
            "inbound_nodes": [
                [
                    [
                        "dropout_12",
                        0,
                        0,
                        {}
                    ]
                ]
            ]
        },
        {
            "class_name": "LeakyReLU",
            "config": {
                "name": "leaky_re_lu_25",
                "trainable": true,
                "dtype": "float32",
                "alpha": 0.10000000149011612
            },
            "name": "leaky_re_lu_25",
            "inbound_nodes": [
                [
                    [
                        "conv1d_23",
                        0,
                        0,
                        {}
                    ]
                ]
            ]
        },
        {
            "class_name": "Dropout",
            "config": {
                "name": "dropout_13",
                "trainable": true,
                "dtype": "float32",
                "rate": 0.5,
                "noise_shape": null,
                "seed": null
            },
            "name": "dropout_13",
            "inbound_nodes": [
                [
                    [
                        "leaky_re_lu_25",
                        0,
                        0,
                        {}
                    ]
                ]
            ]
        },
        {
            "class_name": "MaxPooling1D",
            "config": {
                "name": "max_pooling1d_11",
                "trainable": true,
                "dtype": "float32",
                "strides": [
                    2
                ],
                "pool_size": [
                    2
                ],
                "padding": "valid",
                "data_format": "channels_last"
            },
            "name": "max_pooling1d_11",
            "inbound_nodes": [
                [
                    [
                        "dropout_13",
                        0,
                        0,
                        {}
                    ]
                ]
            ]
        },
        {
            "class_name": "Flatten",
            "config": {
                "name": "flatten_2",
                "trainable": true,
                "dtype": "float32",
                "data_format": "channels_last"
            },
            "name": "flatten_2",
            "inbound_nodes": [
                [
                    [
                        "max_pooling1d_11",
                        0,
                        0,
                        {}
                    ]
                ]
            ]
        },
        {
            "class_name": "Dense",
            "config": {
                "name": "dense_4",
                "trainable": true,
                "dtype": "float32",
                "units": 16,
                "activation": "linear",
                "use_bias": true,
                "kernel_initializer": {
                    "class_name": "GlorotUniform",
                    "config": {
                        "seed": null
                    }
                },
                "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
            },
            "name": "dense_4",
            "inbound_nodes": [
                [
                    [
                        "flatten_2",
                        0,
                        0,
                        {}
                    ]
                ]
            ]
        },
        {
            "class_name": "LeakyReLU",
            "config": {
                "name": "leaky_re_lu_26",
                "trainable": true,
                "dtype": "float32",
                "alpha": 0.10000000149011612
            },
            "name": "leaky_re_lu_26",
            "inbound_nodes": [
                [
                    [
                        "dense_4",
                        0,
                        0,
                        {}
                    ]
                ]
            ]
        },
        {
            "class_name": "Dropout",
            "config": {
                "name": "dropout_14",
                "trainable": true,
                "dtype": "float32",
                "rate": 0.5,
                "noise_shape": null,
                "seed": null
            },
            "name": "dropout_14",
            "inbound_nodes": [
                [
                    [
                        "leaky_re_lu_26",
                        0,
                        0,
                        {}
                    ]
                ]
            ]
        },
        {
            "class_name": "Dense",
            "config": {
                "name": "dense_5",
                "trainable": true,
                "dtype": "float32",
                "units": 2,
                "activation": "softmax",
                "use_bias": true,
                "kernel_initializer": {
                    "class_name": "GlorotUniform",
                    "config": {
                        "seed": null
                    }
                },
                "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
            },
            "name": "dense_5",
            "inbound_nodes": [
                [
                    [
                        "dropout_14",
                        0,
                        0,
                        {}
                    ]
                ]
            ]
        }
    ],
    "input_layers": [
        [
            "conv1d_16_input",
            0,
            0
        ]
    ],
    "output_layers": [
        [
            "dense_5",
            0,
            0
        ]
    ]
}